Revit 2018 API
BuiltInFailures.PartMakerMethodForFamilyInstanceFailures Class
 Failures related to part creation from family instances.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public static class PartMakerMethodForFamilyInstanceFailures
Visual Basic
Public NotInheritable Class PartMakerMethodForFamilyInstanceFailures
Visual C++
public ref class PartMakerMethodForFamilyInstanceFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForFamilyInstanceFailures
See Also
BuiltInFailures.PartMakerMethodForFamilyInstanceFailures Members
Autodesk.Revit.DB Namespace